wsdl/countries.wsdl

<wsdl:definitions 
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:sch="http://spring.io/guides/gs-producing-web-service" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
    xmlns:tns="http://spring.io/guides/gs-producing-web-service" 
    targetNamespace="http://spring.io/guides/gs-producing-web-service">

    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import 
                namespace="http://spring.io/guides/gs-producing-web-service" 
                schemaLocation="/ws/countries.xsd" />
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="getCountryResponse">
        <wsdl:part 
            element="tns:getCountryResponse" 
            name="getCountryResponse" />
    </wsdl:message>

    <wsdl:message name="getCountryRequest">
        <wsdl:part 
            element="tns:getCountryRequest" 
            name="getCountryRequest" />
    </wsdl:message>

    <wsdl:portType name="CountriesPort">
        <wsdl:operation name="getCountry">
            <wsdl:input 
                message="tns:getCountryRequest" 
                name="getCountryRequest" />
            <wsdl:output 
                message="tns:getCountryResponse" 
                name="getCountryResponse" />
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="CountriesPortSoap11" type="tns:CountriesPort">
        <soap:binding 
            style="document" 
            transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="getCountry">
            <soap:operation soapAction="" />
            <wsdl:input name="getCountryRequest">
                <soap:body use="literal" />
            </wsdl:input>
            <wsdl:output name="getCountryResponse">
                <soap:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="CountriesPortService">
        <wsdl:port 
            binding="tns:CountriesPortSoap11" 
            name="CountriesPortSoap11">
            <soap:address 
                location="http://localhost:8080/ws" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
